app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
  def index
    @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 187]]
---
  def show
    @song = Song.find(params[:id])

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-08-29 18:54:24.843578"], ["updated_at", "2018-08-29 18:54:24.843578"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-08-29 18:54:24.851440"], ["updated_at", "2018-08-29 18:54:24.851440"]]
---
  def upload
    CSV.foreach(params["file"].path, headers: true) do |file|
      Song.create(title: file[0], artist_name: file[1])